

var data = [
  {
    url: "https://degarashibanchi.github.io/articles_text/",
    title: "Articles_Texts",
    date: "2022-02-11T09:25:00+09:00",
    body: "Articles_Texts"

  },
  {
    url: "https://degarashibanchi.github.io/categories/",
    title: "Categories",
    date: "2022-02-11T09:25:00+09:00",
    body: "Categories"

  },
  {
    url: "https://degarashibanchi.github.io/tags/",
    title: "Tags",
    date: "2022-02-11T09:25:00+09:00",
    body: "Tags"

  },
  {
    url: "https://degarashibanchi.github.io/articles_text/first/",
    title: "ことはじめ",
    date: "2022-02-11T09:25:00+09:00",
    body: "ことはじめ ▼ことはじめ 　「個人的なサイトを立ち上げる必要がある！」 2021年は11月末の決意である。 理由は種々あるが、大雑把に言えば制作物を乗せておく場所が欲しくなったためだ。 それからあれこれと調べ回り、HTMLに打ちのめされCSSに振り回され、デザインを足し引きしたりして、どうにかこのような形でサイトを立ち上げることが出来たわけだが、ことここに到り、妙な壁に突き当たった。 最初の記事が書けない！ ……というような上記の文章を書いたのが2022年1月14日。 そして今この文章を書き進めているのが、同年2月11日。約一か月近く最初の記事を寝かせてきたことになる。酒や味噌ではあるまいし、放置している間にこの文字たちが熟成されるはずもなく、むしろ腐臭すら漂っている気さえする。 なんかせにゃならん。そう思いつつ、エディタに向かって一文字もタイプ出来ない日々が続いたけれど、もう限界だろう。このままではいくら経っても何ひとつ始まりやしない。 ではどうするか。 答えは簡単である。完成させるのをあきらめよう！ そも、何故記事を書けなかったのかと言えば、それは「記事を完成させる」ということに対するハードルを、自分の中で勝手に上げ過ぎていたためだ。 何と言っても最初の記事なのだから、このサイトを立ち上げた目的、それまでに経験した苦労の数々、当該記事が世に与えるであろう影響、世界経済の行末、環境問題その他諸々……要はクォリティアップのための諸々をどっさりと盛り込もうという意気込みが、実現のために超えるべきハードルを、私の実力を置き去りにして遥か彼方の高みまで押し上げていたわけだ。 しかし考えても見よ、そもそも自分にそのような高尚かつ人類のためになるような高い志を持つ記事を執筆できるものか？ つまり、ここに投げるのは適当な文章でしかないのだから。 何処で聞いたのかすら忘れたけれど、サイトなりブログなりというものは、立ち上げてから2年足らずでポシャってしまうことが大変に多いという。 我が身を振り返れば、2年はおろか2か月、いや2週間、いやいや2日そこらで投げ出した習慣や作品のなんと多い事か。 PCや部屋、脳みその片隅に積みあがったこれらもまた「無暗に高められたハードル」の犠牲者と言えなくもないだろう。たぶん。 だからこう言おう。所詮自分にはこの程度しか書けないし、この程度でいいんだ。 胸を張るのも馬鹿馬鹿しいけど、腐らせて置くのはもっと下らない。 そんなわけで、こんなサイトを始めました、今後ともよろしくお願い申し上げます。"

  },
  {
    url: "https://degarashibanchi.github.io/tags/%E3%81%9D%E3%81%AE%E4%BB%96/",
    title: "その他",
    date: "2022-02-11T09:25:00+09:00",
    body: "その他"

  },
  {
    url: "https://degarashibanchi.github.io/",
    title: "出涸らし闇ナベ",
    date: "2022-02-11T09:25:00+09:00",
    body: "出涸らし闇ナベ"

  },
  {
    url: "https://degarashibanchi.github.io/categories/%E6%97%A5%E8%A8%98/",
    title: "日記",
    date: "2022-02-11T09:25:00+09:00",
    body: "日記"

  },
  {
    url: "https://degarashibanchi.github.io/search/data.js",
    title: "",
    date: "0001-01-01T00:00:00Z",
    body: ""

  },
  {
    url: "https://degarashibanchi.github.io/archives/",
    title: "Archives",
    date: "0001-01-01T00:00:00Z",
    body: "Archives"

  },
  {
    url: "https://degarashibanchi.github.io/search/",
    title: "Searches",
    date: "0001-01-01T00:00:00Z",
    body: "Searches"

  },
];
