

var data = [
  {
    url: "https://degarashibanchi.github.io/articles_text/",
    title: "Articles_Texts",
    date: "2022-03-08T16:47:23+09:00",
    body: "Articles_Texts"

  },
  {
    url: "https://degarashibanchi.github.io/categories/",
    title: "Categories",
    date: "2022-03-08T16:47:23+09:00",
    body: "Categories"

  },
  {
    url: "https://degarashibanchi.github.io/tags/",
    title: "Tags",
    date: "2022-03-08T16:47:23+09:00",
    body: "Tags"

  },
  {
    url: "https://degarashibanchi.github.io/tags/%E3%81%9D%E3%81%AE%E4%BB%96/",
    title: "その他",
    date: "2022-03-08T16:47:23+09:00",
    body: "その他"

  },
  {
    url: "https://degarashibanchi.github.io/articles_text/20220308/",
    title: "オオサカへ行く話",
    date: "2022-03-08T16:47:23+09:00",
    body: "オオサカへ行く話 　情景描写に苦手意識がある。 少しばかり用事があって、大阪へ向かう火があった。 　ままならない趣味のひとつにTRPGがある。最初に触れたTRPGは「サタスペ」というシステムで、これは……という、シニカルでカオスなとんでもない世界観が特色である。 　この、オオサカの世界にキャラクターを立たせる。ということ。 ふと出歩いたオオサカの地下鉄、その駅に日本刀を差したガスマスク少年だの、武装宇宙服の中年だの、天狗の面を付けた本物の天狗だの、 そういうものに会える世界を創造する。"

  },
  {
    url: "https://degarashibanchi.github.io/",
    title: "出涸らし闇ナベ",
    date: "2022-03-08T16:47:23+09:00",
    body: "出涸らし闇ナベ"

  },
  {
    url: "https://degarashibanchi.github.io/categories/%E6%97%A5%E8%A8%98/",
    title: "日記",
    date: "2022-03-08T16:47:23+09:00",
    body: "日記"

  },
  {
    url: "https://degarashibanchi.github.io/tags/%E3%82%AF%E3%83%A9%E3%83%95%E3%83%88/",
    title: "クラフト",
    date: "2022-02-25T21:16:46+09:00",
    body: "クラフト"

  },
  {
    url: "https://degarashibanchi.github.io/tags/%E6%89%8B%E5%B8%B3/",
    title: "手帳",
    date: "2022-02-25T21:16:46+09:00",
    body: "手帳"

  },
  {
    url: "https://degarashibanchi.github.io/articles_text/20220225/",
    title: "手帳を作り直すことについて　02:設計",
    date: "2022-02-25T21:16:46+09:00",
    body: "手帳を作り直すことについて　02:設計 手帳を作り直すことについて　02:設計 　手帳を作り直すことについて　01:計画にて、手帳の改善点をどうにか上げることが出来た。 ……が、そもそも手帳自体の設計をどうしていたのかをすっかり失念していたので、備忘録代わりに手帳の寸法やら何やらを確認しておく。 開き方 　今のところ、手帳は3面を想定している。罫線ノート、ウィークリー、マンスリーの3種類のリフィルをそれぞれ収納するためだ。 リフィルの大きさと手帳のサイズ 　手帳用の紙はコスト面の問題から、A4のコピー用紙に罫線を印刷したモノを半分にカットして使用している。A4の1/2だからその大きさはA5、148mm×210mmになる。 手帳本体はこのサイズがちょうど収まる……という寸法だと、折り畳んだ際に端がはみ出たりするので、周囲に10mmの余白をとって+20mmの168mm×230mmがいいだろう。これが1つの面の寸法となるわけ。 各々の面を横に繋げて三面鏡のように開く手帳にするのだが、この時各面の間に隙間が無いと、リフィルを収納してから折り畳む際に厚みを吸収できず、ゴワッとした畳み心地になる。 これを避けるために、面と面の間には15mmの間隔を空けることにしよう。つまり、開いた際のサイズは(148+20)×3+15×2mm = 534mmとなる。縦は特に変更する必要がない。 布の裁断 　三面開きにする都合上、布は3つの面をすべて覆う必要がある。端で折り返して接着することも考えると、糊代に10mmは欲しいところ。 上で書いたように、3つの面を並べたサイズは534mm×230mmになるので、糊代10mmを足して545mm*240mmが布の大きさだ。 ペン入れ 　前回の記事で書いたように、手帳ベルト兼ペンホルダーを作って仕舞うのが一番便利そうではある。 ベルトは手帳を畳んだ際の外周+αの長さがあればよいだろう。厚みをやや太目に見積もって20mmとすれば、その外周は表紙と裏表紙の横幅+厚み2になるはず。 結果は1682+20*2mm = 376mm。+αの分も含めてキリの良い400mmなら問題ないか？ とまあ、かなり雑ながら大まかな設計は出来た。次はこれを図に書き起こして、厚紙や布を切り出す際のテンプレートにするところからか。"

  },
  {
    url: "https://degarashibanchi.github.io/articles_text/20220218/",
    title: "手帳を作り直すことについて　01:計画",
    date: "2022-02-18T18:12:13+09:00",
    body: "手帳を作り直すことについて　01:計画 手帳を作り直すことにする ブログ用に撮った自作手帳 3つ折りでそれなりに気に入ってはいるけど そろそろ作り直したいところ pic.twitter.com/jTrDnKv3pj \u0026mdash; 出汁殻ニボシ (@Degarashi_Banch) 2022年2月18日 　全くもって唐突だが、これが今現在使用している手帳である。 手帳とはいっても、なにせ厚紙と布を接着剤で張り付けただけの簡素な作りだから、そう大した代物ではない。 材料さえ揃えれば30分程で作れるし、乾燥時間を考えても2時間あれば十分だ。 材料も、表紙・裏表紙・帯ポケットそれぞれに使う3種類の布と、適当な厚紙、後は布用接着剤で問題ない。どれも思い立ったその日に百円ショップで入手できるから、うっかり出先で手帳を作りたくなった場合でも即時対応が可能である。 そして、こんな作りでありながらそれなりに耐久性が高いのも便利なポイント。作成したのが2019/4/12となっているので、そろそろ3年目に突入しようかという、しぶとい奴である。 　何故突然こんなものを出したのかというと、この手帳の出来に不満があるからである。 上でぺらぺらと薄っぺらい褒め言葉を並べておいて何をいきなりと思われるかもしれないが、3年弱も使っていると細かな不満が積もりあがって目に付き始めてくる。ざっと書き出してみると…… 改造案 下敷き 　この手帳、緑色の部分は帆布という厚手の布で出来ており、これはなかなか頑丈で汚れも付きにくく、水に濡れてもそこまで痛まないという大変に便利な素材なのだが、いかんせん目が粗く、この上でモノを書くとペン先がめり込んで紙の上に糸の模様が出てきてしまうことがある。 それを避けるために、手帳の内側には厚紙を模様付きの紙で覆った、いわば下敷きのようなモノを敷いているのだけど、どうも薄すぎて頼りない。書いているうちにイヤな曲がり方をすることがある。良くない。 なので、この部分の厚みを増やすか、あるいはPPシート的な一定以上の硬さのあるモノに取り替えてしまいたい。 ペンの収納 　昔から筆箱がそこまで好きではなかった。別に筆箱そのものに恨みとかはないけど、荷物が増えるのが凄くイヤだった。 だから手帳の作成計画を練る時に「とりあえず最低限の筆記用具は一緒に持ち運べるようにしよう！」と決めた。その結果が、本の帯のように手帳の下半分を覆っているポケットだ。 山折りにした薄い布を表紙と裏表紙で挟み込んで固定しただけのどエラいシンプルな仕組みで、ペンの他にA5サイズまでの紙ならホイホイ挟んで置ける。 置けるのだが……特に何も考えず、適当な長さの布で作ったため、どのペンもやや斜めにしないと固定することが出来ないという問題点がある。 これを解消するためには、ポケットとは別のところにペンを挟んでおくスペースを作る必要がある。 市販のモノを見てみると、手帳を閉じるためのベルトがそのままペンホルダーになっているタイプなどが見つかる。この辺をどうにか使えないだろうか……。 内側の紙の模様が目に悪い 手帳の内側に貼ってある紙 じっと見てると目がチカチカしてくる… pic.twitter.com/LbU4aiX6qB \u0026mdash; 出汁殻ニボシ (@Degarashi_Banch) February 18, 2022 換えよう。 　とまあ、軽く考えてもこのくらいの改造案が出てくる。 どうせこうやって記事に出来るのだし、早速改造に着手するとしよう。"

  },
  {
    url: "https://degarashibanchi.github.io/articles_text/first/",
    title: "ことはじめ",
    date: "2022-02-11T09:25:00+09:00",
    body: "ことはじめ ことはじめ 　「個人的なサイトを立ち上げる必要がある！」 2021年は11月末の決意である。 理由は種々あるが、大雑把に言えば制作物を乗せておく場所が欲しくなったためだ。 それからあれこれと調べ回り、HTMLに打ちのめされCSSに振り回され、デザインを足し引きしたりして、どうにかこのような形でサイトを立ち上げることが出来たわけだが、ことここに到り、妙な壁に突き当たった。 最初の記事が書けない！ 大まかなサイトデザインは完成し、さあ公開しようとしたところでいきなり躓くことになるとは。 ともあれ書かねばならない。もう8割くらい完成してるんだし、そのままにしてる方がもったいないし。 ……というような文章を書いたのが2022年1月14日。 そして今この文章を書き進めているのが、同年2月11日。約一か月近く最初の記事を寝かせてきたことになる。酒や味噌ではあるまいし、放置している間にこの文字たちが熟成されるはずもなく、むしろ腐臭すら漂っている気さえする。 なんとかせにゃならん。そう思いつつ、いざエディタに向かったところで一文字もタイプ出来ない日々が続いたけれど、もう限界だろう。このままではいくら経っても何ひとつ始まりやしない。 ではどうするか。いつまでも動き出せないプロジェクトをどうやって再起動させようか？ 答えは簡単である。それは、完成させるのを諦めることだ！ そも、何故記事を書けなかったのかと言えば、それは「記事を完成させる」ということに対するハードルを、自分の中で勝手に上げ過ぎていたためだ。 何と言っても最初の記事なのだから、このサイトを立ち上げた目的、それまでに経験した苦労の数々、これからの意気込み、やがて記事が大きくハネた際に当該記事が世に与えるであろう影響、そこから巻き起こる我がサイトの爆発的な流行によって訪れるであろう世界経済の混乱、人心と環境問題その他諸々……などなど。 要はクォリティアップのための諸々をどっさりと盛り込もうという意気込みが、実現のために超えるべきハードルを、私の実力を置き去りにして遥か彼方の高みまで押し上げていたわけだ。 しかし考えても見よ、そもそも自分にそのような高尚かつ人類のためになるような高い志を持つ記事を執筆できるものか？ 何処で聞いたのかすら忘れたけれど、サイトなりブログなりというものは、立ち上げてから2年足らずでポシャってしまうことが大変に多いという。 我が身を振り返れば、2年はおろか2か月、いや2週間、いやいや2日そこらで投げ出した習慣や作品のなんと多い事か。 PCや部屋、脳みその片隅に積みあがったこれらもまた「無暗やたらと高められたハードル」の犠牲者と言えなくもないだろう。たぶん。 だからこう言おう。所詮自分にはこの程度しか書けないし、この程度でいいんだ。 胸を張るのも馬鹿馬鹿しいけど、腐らせておくのはもっと下らない。 完成してなくたって構うまい。だってここに文字列を書き込んだところで、急に誰かが不幸になるわけでもないんだし。 そんなわけで、無責任にもこんなサイトを始めました、今後ともよろしくお願い申し上げます。"

  },
  {
    url: "https://degarashibanchi.github.io/search/data.js",
    title: "",
    date: "0001-01-01T00:00:00Z",
    body: ""

  },
  {
    url: "https://degarashibanchi.github.io/archives/",
    title: "Archives",
    date: "0001-01-01T00:00:00Z",
    body: "Archives"

  },
  {
    url: "https://degarashibanchi.github.io/search/",
    title: "Searches",
    date: "0001-01-01T00:00:00Z",
    body: "Searches"

  },
];
